camerongillingham93/night-light/software/Microchip.ATtiny_DFP.3.2.268/Microchip.ATtiny_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
         schemaVersion="1.3"
         xs:schemaLocation="http://www.atmel.com/schemas/pack-device-atmel-extension PACK.DEVICE.ATMEL.EXTENSION.xsd"
         xs:noNamespaceSchemaLocation="PACK.ATMEL.xsd">
   <vendor>Microchip</vendor>
   <url>https://packs.download.microchip.com/</url>
   <name>ATtiny_DFP</name>
   <description>Microchip ATtiny Series Device Support</description>
   <releases>
      <release version="3.2.268" date="2025-01-13">
        - Updated access bits for USART, CTRL, and STATUS registers.
      </release>
      <release version="3.1.260" date="2023-08-16">
        - DEVXML-2266 Added LUT Clock Source Selection enum for tiny devices with CCL.
        - MPLABXE-6896 Display AVR device ID and rev ID in the correct order in MPLAB X.
        - DEVXML-2266 Added description of CCL LUT clock source.
        - DEVXML-2266 Added pin information for CCL LUT outputs.
        - DEVXML-4748 Fixed description of location of XDIR0 ALT1 pin.
        - DEVXML-4492 Removed EVOUTC from port multiplexer EVSYS for ATTiny1624.
      </release>
      <release version="3.0.151" date="2022-03-02">
        - Multiple updates to AVR8X ATDFs, including new mode description and updated ATDF schema to version 4.5.
        - Updated FUSES initvals for AVR8X devices.
        - Removed deprecated SIG-defines from ATtiny11/12/15.
        - Added HV_IMPLEMENTATION property to indicate available UPDI HV option.
        - For AVR8X devices, added an underscore between bitfield name and bitfield bit-number for bitfield defines on bitfields with more than one bit for both C-header and assembler .inc files.
        - For AVR8X devices, changed LOCKBIT struct define name to LOCK_BIT to avoid redefine issue.
        - For AVR8X devices, replaced master/slave with host/client in captions.
      </release>
      <release version="2.7.128" date="2021-07-13">Corrected AVR-LibC device macro for ATtiny84A.</release>
      <release version="2.6.122" date="2021-03-01">Added support for ATtiny322x. Changed nomenclature for serial communication. Fixed mapping of RAM addresses 0x3C00-0x3FFF for ATtiny1617/1616/1614 RTL-based simulator model. Removed external 32kHz crystal option from ATtiny160x/80x/40x/20x. Added SYSCFG0.TOUTDIS for ATtiny42x/82x/162x. Added value NONE (0x00) to TCA0.SINGLE.EVCTRL EVACTB. Added CCL TRUTH bitfields for several devices. Joined CCL_SEQSEL0 and CCL_SEQSEL1 into one value-group, CCL_SEQSEL, for ATtiny42x/82x/162x.</release>
      <release version="2.5.116" date="2020-09-18">Added support for ATtiny42x and ATtiny82x. Added missing CCL INSEL options for ATtiny161x and ATtiny321x. Corrected AC DACREF bitfield name for ATtiny162x. Added PAGE_SIZE for memories in several assembler include files. Fixed issue with debug session aborting due to handing of DBGRUN bit.</release>
      <release version="2.4.108" date="2020-08-27">Updated copyright notice in c-header files. Corrected ADC MUXPOS and MUXNEG values, corrected PORTMUX.TCAROUTEA and PORTMUX.TCAROUTEB bitfields, added more values to other PORTMUX bitfields and renamed the ADC DAC source to DACREF0 for ATtiny162x devices.</release>
      <release version="2.3.92" date="2020-06-04">Timer/Counter caption correction. Corrected PORTMUX.EVSYSROUTEA bitfield names for ATtiny162x devices.</release>
      <release version="2.2.89" date="2020-05-05">Changes to support files for XC8 2.20. Added magic offsets for fuse and lockbits in PIC file. Corrected USART CTRLC reset value for ATtiny161x, ATtiny4xx and ATtiny2xx. Added LOCKBITS_DEFAULT and corrected MAPPED_PROGMEM rw-attribute for AVR8X devices. Show memory mapped flash in MPLAB X.</release>
      <release version="2.1.63" date="2019-12-18">Added memberofperipheral for VirtualPin in PIC files. Updated fuse information for ATtiny3217/3216/1617/1616/1614. Removed duplication of PROGMEM defines. Group adjacent reserved bytes in arrays in the header files. Corrected defines for ATtiny1634. Corrected PA1 and PA2 pad connection for ATtiny202/212/402/412. Added missing TCCR1B.PWMX bit for ATtiny261/261A/461/461A/861/861A. Added ATtiny1627/1626/1624.</release>
      <release version="2.0.10" date="2019-04-25">Added missing TCB1 PORTMUX for ATtiny3217/3216/1617/1616/1614. Added missing TCCR1B.PWMX bit for ATtiny261/261A/461/461A/861/861A.</release>
      <release version="2.0.2" date="2019-01-24">Corrected TC2 instance in ATtiny441. Corrected defines for ATtiny1634. Refactored away family header files, now there is one header file per device. Corrected FUSE_MEMORY_SIZE for ATtiny4/5/9/10/20/40. Added simulator support for mega1609/1608/809/808. Succeeds Atmel.ATtiny_DFP 1.3.229.</release>
   </releases>
   <keywords>
      <keyword>Microchip</keyword>
      <keyword>Device Family Package Microchip</keyword>
      <keyword>Device Support</keyword>
      <keyword>ATtiny</keyword>
   </keywords>
   <devices>
      <family Dfamily="ATtiny" Dvendor="Microchip:3">
         <processor Dcore="AVR8L"
                    Dendian="Little-endian"
                    Dmpu="NO_MPU"
                    Dfpu="NO_FPU"/>
         <environment name="microchip">
            <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                            schemaVersion="1.0">
               <mchp:prerequisite component="MPLAB X IDE" version="[5.10-"/>
               <mchp:prerequisite component="MPLAB X IPE" version="[5.10-"/>
            </mchp:extension>
         </environment>
         <device Dname="ATtiny3214">
            <deprecated>2019-01-24</deprecated>
         </device>
         <device Dname="ATtiny10">
            <processor Dcore="AVR8L"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/avr/iotn10.h"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/ATtiny10.atdf"/>
                  <at:variant ordercode="ATtiny10-TSHR"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATtiny10-MAHR"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATtiny10-TS8R"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="125"/>
                  <at:memory start="0x0000"
                             size="0x0400"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="FLASH"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory type="io"
                             size="0x40"
                             start="0x0000"
                             name="IO"
                             address-space="data"/>
                  <at:memory type="ram"
                             size="0x20"
                             start="0x0040"
                             name="SRAM"
                             address-space="data"/>
                  <at:memory type="sysreg"
                             size="0x0002"
                             start="0x3F00"
                             name="MAPPED_NVM_LOCK_BITS"
                             address-space="data"/>
                  <at:memory type="sysreg"
                             size="0x0002"
                             start="0x3F40"
                             name="MAPPED_CONFIGURATION_BITS"
                             address-space="data"/>
                  <at:memory type="sysreg"
                             size="0x0002"
                             start="0x3F80"
                             name="MAPPED_CALIBRATION_BITS"
                             address-space="data"/>
                  <at:memory type="sysreg"
                             size="0x0004"
                             start="0x3FC0"
                             name="MAPPED_DEVICE_ID_BITS"
                             address-space="data"/>
                  <at:memory type="flash"
                             start="0x4000"
                             name="MAPPED_FLASH"
                             size="0x0400"
                             address-space="data"/>
                  <at:interface type="tpi" name="TPI"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.ice4"/>
                  <at:tool id="com.atmel.avrdbg.tool.ispmk2"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk600"/>
                  <at:tool id="com.atmel.avrdbg.tool.simulator"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.key" value="ATtiny10"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.model.win32"
                               value="simulator/win32/libattiny10.dll"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.model.linux64"
                               value="simulator/linux64/libattiny10.so"/>
                  <at:property name="com.atmel.gcc.options.mmcu" value="attiny10"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone AVRASM Project">
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.asm)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="AVR8-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="AVRASM" component="AVRASM"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="edc/ATtiny10.PIC"/>
                  <mchp:xc8 name="xc8"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD5.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmSimulator.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="hwtools/persfr/avr8.persfr"/>
                  </mchp:hwtool>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.35-"/>
                  <mchp:prerequisite component="MPLAB XC8" version="[2.20-"/>
               </mchp:extension>
            </environment>
            <description>8-bit AVR Microcontroller, 1KB Flash, 6/8-pin, ADC</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATtiny10"
                  title="Device page for ATtiny10"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATtiny10"
                  title="Datasheet"/>
         </device>
